TED-Ed/2014-01-06 How to fossilize yourself.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2025-01-09 Thu 23:07 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>&lrm;</title>
<meta name="author" content="DESKTOP-13B7HQM" />
<meta name="generator" content="Org Mode" />
</head>
<body>
<div id="content" class="content">
<div id="outline-container-org6865eec" class="outline-2">
<h2 id="org6865eec">2014-01-06 How to fossilize yourself</h2>
<div class="outline-text-2" id="text-org6865eec">
<p class="verse">
Imagine being a fossil: touring the world's great museums,<br />
&#xa0;inspiring awe in onlookers of all ages, posing for hordes of fawning photographers.<br />
Sound like something you'd like?<br />
Well, good luck!<br />
At least 99.9% of creatures that have ever lived aren't preserved in the fossil record.<br />
But forget about them, everyone else will, and listen up!<br />
If you want your corpse in the exclusive 0.01% Club, the Hall of Preserved Fossil Fame,<br />
&#xa0;it will not be easy.<br />
You better work!<br />
Step one: die.<br />
It's a cold, hard fact of fossilization.<br />
Everything paleontologists find was once alive and, at some point, died.<br />
We'll skip the details and assume you had a long, fulfilling life<br />
&#xa0;so we can get to what is really important &#x2013; how you die.<br />
<br />
There are many ways to become a fossil, so let's highlight your top death options.<br />
You could get yourself trapped in tree sap,<br />
&#xa0;which, when hardens, turns into amber and can survive intact for millions of years.<br />
But unless you find a really big tree to sit under,<br />
&#xa0;amber preservation will likely remain the domain of insects and other very small animals.<br />
Generally, the right place to be if you want to end up a fossil<br />
&#xa0;is wherever sediment is actively being deposited, like a lake or an ocean floor.<br />
A mountaintop or prairie? Not good!<br />
You need to get buried, the faster the better,<br />
&#xa0;because the longer you hang around on the surface,<br />
&#xa0;&#xa0;the more likely you'll get eaten, scavenged, or otherwise destroyed<br />
&#xa0;&#xa0;&#xa0;before ever having a chance to get preserved.<br />
If you can get buried someplace with little to no oxygen,<br />
&#xa0;&#xa0;like a bog or a deep lake bottom,<br />
&#xa0;even better.<br />
That lack of oxygen will slow down your decay and give you more time to fossilize.<br />
So, let's say you're lucky enough to die and get buried<br />
&#xa0;in a shallow sea under muddy, sandy sediments.<br />
What's your next move?<br />
<br />
One option is a process called permineralization.<br />
While all your soft parts decay away, your bones get saturated with mineral-rich waters.<br />
Bit by bit, microscopic crystals precipitate out of these waters<br />
&#xa0;to fill in the empty spaces and pores in your bones.<br />
Otherwise, you'd better hope the sediments around you harden<br />
&#xa0;while your bones decay away<br />
&#xa0;&#xa0;&#xa0;and another sediment or mineral fills in the spaces your bones leave behind,<br />
&#xa0;&#xa0;creating a perfect cast of your skeleton.<br />
Over time, the sediments around your fossil will lithify or turn into rock.<br />
<br />
But you're not in the clear yet!<br />
Many things could happen to those sedimentary rocks<br />
&#xa0;that might destroy your chances of getting discovered.<br />
They could get uplifted into a mountain range<br />
&#xa0;&#xa0;and eroded away or carried along in an oceanic plate<br />
&#xa0;&#xa0;and subducted back into the Earth's mantle, melting your fossil into hot mush.<br />
Fingers crossed your rock surroundings will get gently lifted up by plate tectonics,<br />
&#xa0;sea levels will change,<br />
&#xa0;and you'll end up under dry land close to the surface,<br />
&#xa0;&#xa0;&#xa0;but not so close that erosion from wind and rain wipes you away<br />
&#xa0;&#xa0;before someone can come to find you.<br />
<br />
The last step in this long process, an intrepid paleontologist has to come find you.<br />
Maybe she's a research scientist scouting for fossils your age and type<br />
&#xa0;or just an amateur collector hoping for a fortuitous find.<br />
She whacks away at layers of rock above you<br />
&#xa0;or spots your fossil exposed in a creek bank after a flood.<br />
And there you are, a magnificent scientific discovery, millions of years in the making!<br />
She and her colleagues gently extract you from the surrounding sediment,<br />
&#xa0;measure and photograph all the bits and pieces they find,<br />
&#xa0;and begin the complex task of reconstructing<br />
&#xa0;&#xa0;how and when you lived based on the evidence they find in your bones.<br />
Paleontologists will be some of your biggest fans<br />
&#xa0;along with all those admiring crowds at the museum.<br />
<br />
You made it!<br />
You spent years underground in obscurity, shedding blood, sweat, tears, and your internal organs.<br />
You worked yourself to the bone<br />
&#xa0;until your bones disintegrated and were replaced by minerals and sediments.<br />
But it was all worth it because you're a famous fossil!<br />
Now, you better hold that pose!<br />
</p>
</div>
