TED-Ed/2014-01-06 How to fossilize yourself.org
** expression
fossil [ˈfɑs(ə)l]: n. an animal or plant that lived many thousands of years ago and that has been preserved, or the shape of one of these animals or plants that has been preserved in rock化石
tour [tʊr]: v. to visit several parts of a country or area旅游
fawn [fɔn]: v. to praise someone and be friendly to them in an insincere way, because you want them to like you or give you something奉承, 讨好
exclusive [ɪkˈsklusɪv]: adj. available or belonging only to particular people, and not shared独占的
fossilize [ˈfɑsəlˌaɪz] fossilization: v.n. to become or form a ↑fossil by being preserved in rock变成化石
paleontology [ˌpæliɑnˈtɑlədʒi] paleontologist: n. the study of ↑fossils (=ancient bones, plants etc that have been preserved in rock)古生物学
highlight [ˈhaɪˌlaɪt]: v. to make a problem or subject easy to notice so that people pay attention to it高亮
sap [sæp]: n. the watery substance that carries food through a plant树液
harden [ˈhɑrd(ə)n]: v. to become firm or stiff, or to make something firm or stiff OPP soften变硬
mountaintop [ˈmaʊnt(ə)nˌtɑp]: n. the top part of a mountain山顶
prairie [ˈpreri]: n. a wide open area of fairly flat land in North America which is covered in grass or wheat大草原
bury [ˈberi]: v. to put something under the ground, often in order to hide it埋葬
scavenge [ˈskævəndʒ]: v. if someone scavenges, they search through things that other people do not want, for food or useful objects以(腐肉)为食
bog [bɔɡ]: n. an area of low wet muddy ground, sometimes containing bushes or grasses ⇨ marsh, swamp沼泽
shallow [ˈʃæloʊ]: adj. measuring only a short distance from the top to the bottom OPP deep浅的
muddy [ˈmʌdi]: adj. covered with mud or containing mud泥泞的
sandy [ˈsændi]: adj. covered with sand, or containing a lot of sand沙的
sediment [ˈsedəmənt]: n. solid substances that settle at the bottom of a liquid沉淀物
permineralization : n. 完全矿化
mineral-rich [ˈmɪn(ə)rəl]: adj. 富含矿物质
microscopic [ˌmaɪkrəˈskɑpɪk]: adj. extremely small and therefore very difficult to see用显微镜可见的
pore [pɔr]: n. one of the small holes in your skin that liquid, especially ↑sweat, can pass through, or a similar hole in the surface of a plant毛孔, 小孔, 气孔
subduct ['sʌbdʌkt]: v. 俯冲
surroundings [səˈraʊndɪŋz]: n. the objects, buildings, natural things etc that are around a person or thing at a particular time环境
erosion [ɪˈroʊʒ(ə)n]: n. the process by which rock or soil is gradually destroyed by wind, rain, or the sea腐蚀
intrepid [ɪnˈtrepɪd]: adj. willing to do dangerous things or go to dangerous places – often used humorously SYN brave无畏的
amateur [ˈæməˌtʃʊr]: n. someone who does an activity just for pleasure, not as their job OPP professional业余爱好者
fortuitous [fɔrˈtuɪtəs]: adj. happening by chance, especially in a way that has a good result偶然的, 幸运的
magnificent [mæɡˈnɪfɪs(ə)nt]: adj. very good or beautiful, and very impressive华丽的
shed [ʃed]: adj. GET RID OF to get rid of something that you no longer need or want摆脱
disintegrate [dɪsˈɪntɪˌɡreɪt]: v. to ak up, or make something ak up, into very small pieces(使)分解
plate tectonics [tek'tɒnɪks]: 版块构造
--------------------
imagine doing/being sth.: 想象做某事
inspire awe in sb.: 激起某人的惊叹
hordes of sb.: a large unorganized group of individuals成群的...人
forget about sth.: 忘记某事
listen up: 仔细听
the Hall of sth. Fame: 名人堂
at some point: at an unspecified moment在某个不确定的点
get to sth.: 到达
A. turn into B.: be transformed into or become a particular kind of thing or person A变成B
survive intact: not broken or damaged存活完好
sp. remain the domain of sb.: 遗留为某人的领地
The right place to be if you want to do sth. is wherever + ...: 你想做某事的正确地方是无论哪里...
hang around: to pass time idly or in relaxing or socializing闲逛
slow down (<-> sth.): 减缓
decay away: 逐渐腐烂
give you more time to do sth.: 给你更多时间去做某事
be lucky enough to do sth.: 足够幸运去做某事
What's your next move: 你的下一步是什么
get saturated with sth.: to fill completely with something充满某物
Bit by bit: 一点点
precipitate out of these waters: 从水中析出
hope sb. do sth.: 希望某人做某事
create a perfect cast of sth.: 创造了某物的完美模型
You're not in the clear yet: 你还不能放松
a mountain range: 山脉
erode away sth.: 侵蚀消失某物
Fingers crossed + ...will: 希望成功+...
get gently lifted up: 被抬起
wipe away sth.: to remove (something) by rubbing擦去某物
scout for sth.: 搜寻，寻找
hope for sth.: 希望得到某物
whack away: 凿穿
in a creek bank: 小溪岸边
millions of years in the making: 历经数百万年形成
extract A. from B.: 从B中提取A
begin the complex task of doing sth.: 开始某事的复杂任务
in obscurity: 默默无闻
work oneself to the bone: to work extremely hard, especially for a long time努力到骨子里
hold that pose: 保持这个姿势
