TED-Ed/2014-01-06 How to fossilize yourself.html
<div id="outline-container-org0fbcbef" class="outline-3">
<h3 id="org0fbcbef">expression</h3>
<div class="outline-text-3" id="text-org0fbcbef">
<p>
fossil [ˈfɑs(ə)l]: n. an animal or plant that lived many thousands of years ago and that has been preserved, or the shape of one of these animals or plants that has been preserved in rock化石<br />
tour [tʊr]: v. to visit several parts of a country or area旅游<br />
fawn [fɔn]: v. to praise someone and be friendly to them in an insincere way, because you want them to like you or give you something奉承, 讨好<br />
exclusive [ɪkˈsklusɪv]: adj. available or belonging only to particular people, and not shared独占的<br />
fossilize [ˈfɑsəlˌaɪz] fossilization: v.n. to become or form a ↑fossil by being preserved in rock变成化石<br />
paleontology [ˌpæliɑnˈtɑlədʒi] paleontologist: n. the study of ↑fossils (=ancient bones, plants etc that have been preserved in rock)古生物学<br />
highlight [ˈhaɪˌlaɪt]: v. to make a problem or subject easy to notice so that people pay attention to it高亮<br />
sap [sæp]: n. the watery substance that carries food through a plant树液<br />
harden [ˈhɑrd(ə)n]: v. to become firm or stiff, or to make something firm or stiff OPP soften变硬<br />
mountaintop [ˈmaʊnt(ə)nˌtɑp]: n. the top part of a mountain山顶<br />
prairie [ˈpreri]: n. a wide open area of fairly flat land in North America which is covered in grass or wheat大草原<br />
bury [ˈberi]: v. to put something under the ground, often in order to hide it埋葬<br />
scavenge [ˈskævəndʒ]: v. if someone scavenges, they search through things that other people do not want, for food or useful objects以(腐肉)为食<br />
bog [bɔɡ]: n. an area of low wet muddy ground, sometimes containing bushes or grasses ⇨ marsh, swamp沼泽<br />
shallow [ˈʃæloʊ]: adj. measuring only a short distance from the top to the bottom OPP deep浅的<br />
muddy [ˈmʌdi]: adj. covered with mud or containing mud泥泞的<br />
sandy [ˈsændi]: adj. covered with sand, or containing a lot of sand沙的<br />
sediment [ˈsedəmənt]: n. solid substances that settle at the bottom of a liquid沉淀物<br />
permineralization : n. 完全矿化<br />
mineral-rich [ˈmɪn(ə)rəl]: adj. 富含矿物质<br />
microscopic [ˌmaɪkrəˈskɑpɪk]: adj. extremely small and therefore very difficult to see用显微镜可见的<br />
pore [pɔr]: n. one of the small holes in your skin that liquid, especially ↑sweat, can pass through, or a similar hole in the surface of a plant毛孔, 小孔, 气孔<br />
subduct ['sʌbdʌkt]: v. 俯冲<br />
surroundings [səˈraʊndɪŋz]: n. the objects, buildings, natural things etc that are around a person or thing at a particular time环境<br />
erosion [ɪˈroʊʒ(ə)n]: n. the process by which rock or soil is gradually destroyed by wind, rain, or the sea腐蚀<br />
intrepid [ɪnˈtrepɪd]: adj. willing to do dangerous things or go to dangerous places – often used humorously SYN brave无畏的<br />
amateur [ˈæməˌtʃʊr]: n. someone who does an activity just for pleasure, not as their job OPP professional业余爱好者<br />
fortuitous [fɔrˈtuɪtəs]: adj. happening by chance, especially in a way that has a good result偶然的, 幸运的<br />
magnificent [mæɡˈnɪfɪs(ə)nt]: adj. very good or beautiful, and very impressive华丽的<br />
shed [ʃed]: adj. GET RID OF to get rid of something that you no longer need or want摆脱<br />
disintegrate [dɪsˈɪntɪˌɡreɪt]: v. to ak up, or make something ak up, into very small pieces(使)分解<br />
plate tectonics [tek'tɒnɪks]: 版块构造<br />
</p>
<hr />
<p>
imagine doing/being sth.: 想象做某事<br />
inspire awe in sb.: 激起某人的惊叹<br />
hordes of sb.: a large unorganized group of individuals成群的&#x2026;人<br />
forget about sth.: 忘记某事<br />
listen up: 仔细听<br />
the Hall of sth. Fame: 名人堂<br />
at some point: at an unspecified moment在某个不确定的点<br />
get to sth.: 到达<br />
A. turn into B.: be transformed into or become a particular kind of thing or person A变成B<br />
survive intact: not broken or damaged存活完好<br />
sp. remain the domain of sb.: 遗留为某人的领地<br />
The right place to be if you want to do sth. is wherever + &#x2026;: 你想做某事的正确地方是无论哪里&#x2026;<br />
hang around: to pass time idly or in relaxing or socializing闲逛<br />
slow down (&lt;-&gt; sth.): 减缓<br />
decay away: 逐渐腐烂<br />
give you more time to do sth.: 给你更多时间去做某事<br />
be lucky enough to do sth.: 足够幸运去做某事<br />
What's your next move: 你的下一步是什么<br />
get saturated with sth.: to fill completely with something充满某物<br />
Bit by bit: 一点点<br />
precipitate out of these waters: 从水中析出<br />
hope sb. do sth.: 希望某人做某事<br />
create a perfect cast of sth.: 创造了某物的完美模型<br />
You're not in the clear yet: 你还不能放松<br />
a mountain range: 山脉<br />
erode away sth.: 侵蚀消失某物<br />
Fingers crossed + &#x2026;will: 希望成功+&#x2026;<br />
get gently lifted up: 被抬起<br />
wipe away sth.: to remove (something) by rubbing擦去某物<br />
scout for sth.: 搜寻，寻找<br />
hope for sth.: 希望得到某物<br />
whack away: 凿穿<br />
in a creek bank: 小溪岸边<br />
millions of years in the making: 历经数百万年形成<br />
extract A. from B.: 从B中提取A<br />
begin the complex task of doing sth.: 开始某事的复杂任务<br />
in obscurity: 默默无闻<br />
work oneself to the bone: to work extremely hard, especially for a long time努力到骨子里<br />
hold that pose: 保持这个姿势<br />
</p>
</div>
</div>
