TED-Ed/2014-01-06 How to fossilize yourself.org
** sentences
imagine doing/being sth.:
- Imagine being a programmar working for Apple.
- Imagine staying up all night.
- Imagine setting up a factory.
inspire awe in sb.: 激起某人的惊叹
- There's at least one way to inspire awe in tourists in the West Lake.
- The machine which draws enery from these ants inspires awe in tourists.
- The door embedded into the wall inspires awe in him.
hordes of sb.: a large unorganized group of individuals
- Hordes of fans will meet him at the station.
- Hordes of fans have gathered round in front of the hall on the last of the year.
- During this time, hordes of tourists are being visiting this palace.
forget about sth.: 
- I forgot about our anniversary so that my wife got very angry.
- I forgot about the test which was held last Monday. 
- You have forgotten about what we experienced together.
listen up: 
- Listen up, it's none of your business.
- Listen up, there used to be a beggar asking for a meal once a day.
- Listen up, there was a palace only built from glasses and iron.
the Hall of sth. Fame: 名人堂
- Needless to say, the player, Faker, must be in the Hall of LoL Fame.
- The player, Faker, which has been in the Hall of LoL Fame, is in the face of his loss again.
- The statue of the player in the Hall of LoL Fame will be embedded into the map of this Game.
at some point: at an unspecified moment
- At some point, he was able to mobilize the immune system.
- At some point, he became familiar with those extreme chanllenges.
- At some point, I became expert at writting in English.
get to sth.: 到达
- Listen up, I'll get to the station in a few minutes.
- Decades before, she got to the town where she ran into her husband in the future.
- The fire couldn't get to the forest.
A. turn into B.: be transformed into or become a particular kind of thing or person
- Spoiler alert: the man who cheated on his wife turns into a stone.
- The man turned into a stone after he agreed with my enemy.
- It might be time for you to turn into a frog.
survive intact: not broken or damaged
- There's a certain probability of surviving intact after you paid a ransom of $1000.
- He managed to survive intact in a serious flood.
- For centuries, the palace only built from glasses and iron has survived intact.
sp. remain the domain of sb.: 遗留为某人的领地
- If you kept paying minimum wage, the factory would remain the domain of angry struck workers.
- The kitchen needn't have remained the domain of these ants.
- The bog is said to remian the domian of frogs.
The right place to be if you want to do sth. is wherever + ...: 你想做某事的正确地方是无论哪里...
- The right place to be if you want to study English is wherever there is a computer.
- The right place to be if you want to set up a factory
		is where the authorities don't ask for high taxes.
- The right place to be if you want to sing is where you can't hear any noises.
hang around: to pass time idly or in relaxing or socializing
- I like to hang around by the lake on weekends.
- Decades before, there was a beggar hanging around by the lake.
- My mother got me far away from those beggar hanging around.
slow down (<-> sth.): 减缓
- We're late for work because the craggy road slowed us down.
- The attacks on lymph nodes have slowed his recovery from smallpox.
- He pointed out the growth in sales might have slowed down last year.
decay away: 逐渐腐烂
- The bodies that were dug up by the local villagers decayed away swiftly.
- They should have found the body decay away.
- Fielding China's attacks, these Mongols made their lamb decay away.
give you more time to do sth.: 
- You should have given him more time to satisfy his curiosity.
- He hasn't been give more time to develop a model for an atom.
- My mother gave me more time to watch TV on weekends.
be lucky enough to do sth.: 
- I'm lucky enough to give up smoking.
- She's lucky enough to run a furniture business.
- You're lucky enough to surrender your seat to the boss.
What's your next move: 
- What's your next move? I'm gonna attend a fancy dress party.
- What's your next move? I have no idea.
- What's your next move? Make myself comfortable.
get saturated with sth.: to fill completely with something
- The machine used to get saturated with mineral-rich water on a lake floor.
- Saturated with this special kind of mixture, you'll feel better.
- The electricity meter in the storeroom gets saturated with water.
Bit by bit: 一点点
- Bit by bit, he made a name for himself decades before.
- Bit by bit, these firefighters got the fire under control.
- Bit by bit, he has the authority to look up the database.
precipitate out of these waters: 从水中析出
- He poured scorn on the idea that diamonds will precipitate out of these waters.
- No one could account for the fact that the diamond precipitated out of these waters.
- There was a note of triumph in his voice when the diamond precipitated out of these waters.
hope sb. do sth.: 希望某人做某事
- I hope you pass the test.
- I hope she achive her triumph.
- I hope him make a large sums of money.
create a perfect cast of sth.: 创造了某物的完美模型
- He is an expert at creating casts of these old buildings.
- He created a cast of the old house in momery of his mother.
- He devotes himself to creating casts of these old buildings.
You're not in the clear yet: 你还不能放松
- Though you passed the test, you're not in the clear yet.
- Though you get a better salary, you're not in the clear yet.
- Though your daughter begins to make money, you're not in the clear yet.
a mountain range: 山脉
- There is a mountain range known as the Alpa.
- The mountain range is said to be called the Alpa.
- We have been driving for three days to cross the mountain range.
erode away sth.: 侵蚀消失某物
- It's said that a diamond will never be eroded away.
- I heard about a tree which got eroded away through the centuries.
- I must discern the cause of the tree which is said to get eroded away.
Fingers crossed + ...will: 希望成功+...
- Fingers crossed you will have the authority to meet the princess.
- Fingers crossed you will get to the mythical realms.
- Fingers crossed you will undertake the important task of searching for exterrestrial lives.
get gently lifted up: 被抬起
- The baggage must get gently lifted up.
- With the order given, the baggage got gently lifted up.
- The soft should have gotten gently lifted up.
wipe away sth.: to remove (something) by rubbing
- The authorities are trying to wipe away these street signs.
- I saw you wipe away those signs, you must be an apprentice to a baker.
- I kept wiping away my wife's tears.
scout for sth.: 搜寻，寻找
- He is scounting for the soldier hiding in tussock grasses.
- While scounting for the soldier, he was knocked to the ground.
- These soldiers are scount for a prisoner at large up and down in front of the camp.
hope for sth.: 希望得到某物
- I have hoped for a gun in my youth.
- She hoped for a factory in her hard early years.
- The medical student hopes for a vacation for a period of time.
whack away: 凿穿
- The wall should have been whacked away.
- He whacked away the wall to rescue his cat.
- He whacked away the wall so that he could break into the mall.
in a creek bank: 小溪岸边
- A businessman claimed that he had seen the puma in a creek bank.
- There are a lot of excitements in a creek bank.
- We have made a big mistake in a creek bank.
millions of years in the making: 历经数百万年形成
- The fossil is millions of years in the making.
- The fossil turns out to be millions of years in the making.
- There is a mountain called the Alpa, millions of years in the making.
extract A. from B.: 从B中提取A
- I failed to extract the archive from the compressed file.
- The scientist undertook the arduous task of extracting the skeleton from the surround sediment.
- He went through arduous process of extracting the fossil from the rock.
begin the complex task of doing sth.: 开始某事的复杂任务
- He began the complex task of developing a model for an atom.
- These scientists began the complex task of searching for extraterrestrial lives.
- He began the complex task of translating the textbook into Chinese.
in obscurity: 默默无闻
- The maidservant in obscurity has killed five of her husbands in her youth.
- It is incredible that the writer in obscurity makes a large sum of money.
- The student in obscurity has completed the arduous course.
work oneself to the bone: to work extremely hard, especially for a long time
- My teacher used to ask me to work myself to the bone.
- Although I work myself to the bone, I don't get a good salary.
- I poured scorn on the idea that she decided to work herself to the bone.
hold that pose: 保持这个姿势
- Following my instruction, my wife held that pose so that I could take photographs.
- You looked beautiful while you were holding that pose.
- I anticipated that she couldn't hold that pose for a long time.
