TED-Ed/2014-01-06 How to fossilize yourself.html
<div id="outline-container-org14bd531" class="outline-3">
<h3 id="org14bd531">sentences</h3>
<div class="outline-text-3" id="text-org14bd531">
<p>
imagine doing/being sth.:<br />
</p>
<ul class="org-ul">
<li>Imagine being a programmar working for Apple.<br /></li>
<li>Imagine staying up all night.<br /></li>
<li>Imagine setting up a factory.<br /></li>
</ul>
<p>
inspire awe in sb.: 激起某人的惊叹<br />
</p>
<ul class="org-ul">
<li>There's at least one way to inspire awe in tourists in the West Lake.<br /></li>
<li>The machine which draws enery from these ants inspires awe in tourists.<br /></li>
<li>The door embedded into the wall inspires awe in him.<br /></li>
</ul>
<p>
hordes of sb.: a large unorganized group of individuals<br />
</p>
<ul class="org-ul">
<li>Hordes of fans will meet him at the station.<br /></li>
<li>Hordes of fans have gathered round in front of the hall on the last of the year.<br /></li>
<li>During this time, hordes of tourists are being visiting this palace.<br /></li>
</ul>
<p>
forget about sth.:<br />
</p>
<ul class="org-ul">
<li>I forgot about our anniversary so that my wife got very angry.<br /></li>
<li>I forgot about the test which was held last Monday.<br /></li>
<li>You have forgotten about what we experienced together.<br /></li>
</ul>
<p>
listen up:<br />
</p>
<ul class="org-ul">
<li>Listen up, it's none of your business.<br /></li>
<li>Listen up, there used to be a beggar asking for a meal once a day.<br /></li>
<li>Listen up, there was a palace only built from glasses and iron.<br /></li>
</ul>
<p>
the Hall of sth. Fame: 名人堂<br />
</p>
<ul class="org-ul">
<li>Needless to say, the player, Faker, must be in the Hall of LoL Fame.<br /></li>
<li>The player, Faker, which has been in the Hall of LoL Fame, is in the face of his loss again.<br /></li>
<li>The statue of the player in the Hall of LoL Fame will be embedded into the map of this Game.<br /></li>
</ul>
<p>
at some point: at an unspecified moment<br />
</p>
<ul class="org-ul">
<li>At some point, he was able to mobilize the immune system.<br /></li>
<li>At some point, he became familiar with those extreme chanllenges.<br /></li>
<li>At some point, I became expert at writting in English.<br /></li>
</ul>
<p>
get to sth.: 到达<br />
</p>
<ul class="org-ul">
<li>Listen up, I'll get to the station in a few minutes.<br /></li>
<li>Decades before, she got to the town where she ran into her husband in the future.<br /></li>
<li>The fire couldn't get to the forest.<br /></li>
</ul>
<p>
A. turn into B.: be transformed into or become a particular kind of thing or person<br />
</p>
<ul class="org-ul">
<li>Spoiler alert: the man who cheated on his wife turns into a stone.<br /></li>
<li>The man turned into a stone after he agreed with my enemy.<br /></li>
<li>It might be time for you to turn into a frog.<br /></li>
</ul>
<p>
survive intact: not broken or damaged<br />
</p>
<ul class="org-ul">
<li>There's a certain probability of surviving intact after you paid a ransom of $1000.<br /></li>
<li>He managed to survive intact in a serious flood.<br /></li>
<li>For centuries, the palace only built from glasses and iron has survived intact.<br /></li>
</ul>
<p>
sp. remain the domain of sb.: 遗留为某人的领地<br />
</p>
<ul class="org-ul">
<li>If you kept paying minimum wage, the factory would remain the domain of angry struck workers.<br /></li>
<li>The kitchen needn't have remained the domain of these ants.<br /></li>
<li>The bog is said to remian the domian of frogs.<br /></li>
</ul>
<p>
The right place to be if you want to do sth. is wherever + &#x2026;: 你想做某事的正确地方是无论哪里&#x2026;<br />
</p>
<ul class="org-ul">
<li>The right place to be if you want to study English is wherever there is a computer.<br /></li>
<li>The right place to be if you want to set up a factory<br />
is where the authorities don't ask for high taxes.<br /></li>
<li>The right place to be if you want to sing is where you can't hear any noises.<br /></li>
</ul>
<p>
hang around: to pass time idly or in relaxing or socializing<br />
</p>
<ul class="org-ul">
<li>I like to hang around by the lake on weekends.<br /></li>
<li>Decades before, there was a beggar hanging around by the lake.<br /></li>
<li>My mother got me far away from those beggar hanging around.<br /></li>
</ul>
<p>
slow down (&lt;-&gt; sth.): 减缓<br />
</p>
<ul class="org-ul">
<li>We're late for work because the craggy road slowed us down.<br /></li>
<li>The attacks on lymph nodes have slowed his recovery from smallpox.<br /></li>
<li>He pointed out the growth in sales might have slowed down last year.<br /></li>
</ul>
<p>
decay away: 逐渐腐烂<br />
</p>
<ul class="org-ul">
<li>The bodies that were dug up by the local villagers decayed away swiftly.<br /></li>
<li>They should have found the body decay away.<br /></li>
<li>Fielding China's attacks, these Mongols made their lamb decay away.<br /></li>
</ul>
<p>
give you more time to do sth.:<br />
</p>
<ul class="org-ul">
<li>You should have given him more time to satisfy his curiosity.<br /></li>
<li>He hasn't been give more time to develop a model for an atom.<br /></li>
<li>My mother gave me more time to watch TV on weekends.<br /></li>
</ul>
<p>
be lucky enough to do sth.:<br />
</p>
<ul class="org-ul">
<li>I'm lucky enough to give up smoking.<br /></li>
<li>She's lucky enough to run a furniture business.<br /></li>
<li>You're lucky enough to surrender your seat to the boss.<br /></li>
</ul>
<p>
What's your next move:<br />
</p>
<ul class="org-ul">
<li>What's your next move? I'm gonna attend a fancy dress party.<br /></li>
<li>What's your next move? I have no idea.<br /></li>
<li>What's your next move? Make myself comfortable.<br /></li>
</ul>
<p>
get saturated with sth.: to fill completely with something<br />
</p>
<ul class="org-ul">
<li>The machine used to get saturated with mineral-rich water on a lake floor.<br /></li>
<li>Saturated with this special kind of mixture, you'll feel better.<br /></li>
<li>The electricity meter in the storeroom gets saturated with water.<br /></li>
</ul>
<p>
Bit by bit: 一点点<br />
</p>
<ul class="org-ul">
<li>Bit by bit, he made a name for himself decades before.<br /></li>
<li>Bit by bit, these firefighters got the fire under control.<br /></li>
<li>Bit by bit, he has the authority to look up the database.<br /></li>
</ul>
<p>
precipitate out of these waters: 从水中析出<br />
</p>
<ul class="org-ul">
<li>He poured scorn on the idea that diamonds will precipitate out of these waters.<br /></li>
<li>No one could account for the fact that the diamond precipitated out of these waters.<br /></li>
<li>There was a note of triumph in his voice when the diamond precipitated out of these waters.<br /></li>
</ul>
<p>
hope sb. do sth.: 希望某人做某事<br />
</p>
<ul class="org-ul">
<li>I hope you pass the test.<br /></li>
<li>I hope she achive her triumph.<br /></li>
<li>I hope him make a large sums of money.<br /></li>
</ul>
<p>
create a perfect cast of sth.: 创造了某物的完美模型<br />
</p>
<ul class="org-ul">
<li>He is an expert at creating casts of these old buildings.<br /></li>
<li>He created a cast of the old house in momery of his mother.<br /></li>
<li>He devotes himself to creating casts of these old buildings.<br /></li>
</ul>
<p>
You're not in the clear yet: 你还不能放松<br />
</p>
<ul class="org-ul">
<li>Though you passed the test, you're not in the clear yet.<br /></li>
<li>Though you get a better salary, you're not in the clear yet.<br /></li>
<li>Though your daughter begins to make money, you're not in the clear yet.<br /></li>
</ul>
<p>
a mountain range: 山脉<br />
</p>
<ul class="org-ul">
<li>There is a mountain range known as the Alpa.<br /></li>
<li>The mountain range is said to be called the Alpa.<br /></li>
<li>We have been driving for three days to cross the mountain range.<br /></li>
</ul>
<p>
erode away sth.: 侵蚀消失某物<br />
</p>
<ul class="org-ul">
<li>It's said that a diamond will never be eroded away.<br /></li>
<li>I heard about a tree which got eroded away through the centuries.<br /></li>
<li>I must discern the cause of the tree which is said to get eroded away.<br /></li>
</ul>
<p>
Fingers crossed + &#x2026;will: 希望成功+&#x2026;<br />
</p>
<ul class="org-ul">
<li>Fingers crossed you will have the authority to meet the princess.<br /></li>
<li>Fingers crossed you will get to the mythical realms.<br /></li>
<li>Fingers crossed you will undertake the important task of searching for exterrestrial lives.<br /></li>
</ul>
<p>
get gently lifted up: 被抬起<br />
</p>
<ul class="org-ul">
<li>The baggage must get gently lifted up.<br /></li>
<li>With the order given, the baggage got gently lifted up.<br /></li>
<li>The soft should have gotten gently lifted up.<br /></li>
</ul>
<p>
wipe away sth.: to remove (something) by rubbing<br />
</p>
<ul class="org-ul">
<li>The authorities are trying to wipe away these street signs.<br /></li>
<li>I saw you wipe away those signs, you must be an apprentice to a baker.<br /></li>
<li>I kept wiping away my wife's tears.<br /></li>
</ul>
<p>
scout for sth.: 搜寻，寻找<br />
</p>
<ul class="org-ul">
<li>He is scounting for the soldier hiding in tussock grasses.<br /></li>
<li>While scounting for the soldier, he was knocked to the ground.<br /></li>
<li>These soldiers are scount for a prisoner at large up and down in front of the camp.<br /></li>
</ul>
<p>
hope for sth.: 希望得到某物<br />
</p>
<ul class="org-ul">
<li>I have hoped for a gun in my youth.<br /></li>
<li>She hoped for a factory in her hard early years.<br /></li>
<li>The medical student hopes for a vacation for a period of time.<br /></li>
</ul>
<p>
whack away: 凿穿<br />
</p>
<ul class="org-ul">
<li>The wall should have been whacked away.<br /></li>
<li>He whacked away the wall to rescue his cat.<br /></li>
<li>He whacked away the wall so that he could break into the mall.<br /></li>
</ul>
<p>
in a creek bank: 小溪岸边<br />
</p>
<ul class="org-ul">
<li>A businessman claimed that he had seen the puma in a creek bank.<br /></li>
<li>There are a lot of excitements in a creek bank.<br /></li>
<li>We have made a big mistake in a creek bank.<br /></li>
</ul>
<p>
millions of years in the making: 历经数百万年形成<br />
</p>
<ul class="org-ul">
<li>The fossil is millions of years in the making.<br /></li>
<li>The fossil turns out to be millions of years in the making.<br /></li>
<li>There is a mountain called the Alpa, millions of years in the making.<br /></li>
</ul>
<p>
extract A. from B.: 从B中提取A<br />
</p>
<ul class="org-ul">
<li>I failed to extract the archive from the compressed file.<br /></li>
<li>The scientist undertook the arduous task of extracting the skeleton from the surround sediment.<br /></li>
<li>He went through arduous process of extracting the fossil from the rock.<br /></li>
</ul>
<p>
begin the complex task of doing sth.: 开始某事的复杂任务<br />
</p>
<ul class="org-ul">
<li>He began the complex task of developing a model for an atom.<br /></li>
<li>These scientists began the complex task of searching for extraterrestrial lives.<br /></li>
<li>He began the complex task of translating the textbook into Chinese.<br /></li>
</ul>
<p>
in obscurity: 默默无闻<br />
</p>
<ul class="org-ul">
<li>The maidservant in obscurity has killed five of her husbands in her youth.<br /></li>
<li>It is incredible that the writer in obscurity makes a large sum of money.<br /></li>
<li>The student in obscurity has completed the arduous course.<br /></li>
</ul>
<p>
work oneself to the bone: to work extremely hard, especially for a long time<br />
</p>
<ul class="org-ul">
<li>My teacher used to ask me to work myself to the bone.<br /></li>
<li>Although I work myself to the bone, I don't get a good salary.<br /></li>
<li>I poured scorn on the idea that she decided to work herself to the bone.<br /></li>
</ul>
<p>
hold that pose: 保持这个姿势<br />
</p>
<ul class="org-ul">
<li>Following my instruction, my wife held that pose so that I could take photographs.<br /></li>
<li>You looked beautiful while you were holding that pose.<br /></li>
<li>I anticipated that she couldn't hold that pose for a long time.<br /></li>
</ul>
</div>
</div>
</div>
</div>
</body>
</html>
